/*==============================================================================
	[Fade.cpp]
														Author	:	Keigo Hara
==============================================================================*/
//------------------------------------------------------------------------------
// インクルードファイル
//------------------------------------------------------------------------------
#include "../../h/Framework/Fade.h"
#include "../../h/Framework/FadeManager.h"

//------------------------------------------------------------------------------
// フェードの設定
// 引数　：フェードにかけるフレーム数(int time)
// 　　　　色(Color color)
// 戻り値：なし
//------------------------------------------------------------------------------
void Fade::SetFade(int time, Color color)
{
	FadeManager::Instance().SetFade(time, color.r, color.g, color.b);
}

//------------------------------------------------------------------------------
// フェードの設定
// 引数　：フェードにかけるフレーム数(int time)
// 　　　　赤成分(float r),緑成分(float g),青成分(float b)
// 戻り値：なし
//------------------------------------------------------------------------------
void Fade::SetFade(int time, float r, float g, float b)
{
	FadeManager::Instance().SetFade(time, r, g, b);
}

//------------------------------------------------------------------------------
// フェード中かどうか
// 引数　：なし
// 戻り値：フェード中かどうか
//------------------------------------------------------------------------------
bool Fade::IsFading()
{
	return FadeManager::Instance().IsFading();
}

//------------------------------------------------------------------------------
// フェードアウトが完了したかどうか
// 引数　：なし
// 戻り値：フェードアウトが完了したかどうか
//------------------------------------------------------------------------------
bool Fade::IsFadeOutCompleted()
{
	return FadeManager::Instance().IsFadeOutCompleted();
}