/*==============================================================================
	[FadeManager.cpp]
														Author	:	Keigo Hara
==============================================================================*/
//------------------------------------------------------------------------------
// インクルードファイル
//------------------------------------------------------------------------------
#include "../../h/Framework/FadeManager.h"

//------------------------------------------------------------------------------
// 初期化
// 引数　：幅(float width),高さ(float height)
// 戻り値：なし
//------------------------------------------------------------------------------
void FadeManager::Init(float width, float height)
{
	spr_.Init(width * 0.5f, height * 0.5f, width, height);	// スプライトの初期化
}

//------------------------------------------------------------------------------
// 終了処理
// 引数　：なし
// 戻り値：なし
//------------------------------------------------------------------------------
void FadeManager::UnInit()
{
	// 適当な値で後始末
	r_ = 0;
	g_ = 0;
	b_ = 0;
	a_ = 0.0f;

	value_ = 1.0f;

	bFadeEnable_ = false;
	bFadeOut_ = false;
	bFadeOutCompleted_ = false;
}

//------------------------------------------------------------------------------
// 更新
// 引数　：なし
// 戻り値：なし
//------------------------------------------------------------------------------
void FadeManager::Update()
{
	if(!bFadeEnable_){ return; }	// 有効でないなら終了

	bFadeOutCompleted_ = false;	// フェードアウト完了フラグをオフに

	if(bFadeOut_){	// フェードアウト
		a_ += value_;

		if(a_ >= 1.0f){
			a_ = 1.0f;
			bFadeOut_ = false;
			bFadeOutCompleted_ = true;
		}
	} else{			// フェードイン
		a_ -= value_;

		if(a_ <= 0.0f){
			a_ = 0.0f;
			bFadeEnable_ = false;
		}
	}

	spr_.SetColor(r_, g_, b_, a_ * a_ * (3.0f - 2.0f * a_));	// ease_in_ease_out
}

//------------------------------------------------------------------------------
// 描画
// 引数　：なし
// 戻り値：なし
//------------------------------------------------------------------------------
void FadeManager::Draw()
{
	if(!bFadeEnable_){ return; }	// 有効でないなら終了

	spr_.DrawRect();	// 描画
}

//------------------------------------------------------------------------------
// フェードの設定
// 引数　：フェードにかけるフレーム数(int time)
// 　　　　赤成分(float r),緑成分(float g),青成分(float b)
// 戻り値：なし
//------------------------------------------------------------------------------
void FadeManager::SetFade(int time, float r, float g, float b)
{
	if(bFadeEnable_){ return; }	// 使用中なら終了

	// 引数の反映
	r_ = r;
	g_ = g;
	b_ = b;
	a_ = 0.0f;

	value_ = 1.0f / time;

	// フラグをオンに
	bFadeEnable_ = true;
	bFadeOut_ = true;
}